#### StructuralSectionErrorCode Enumeration

---

|  |
| --- |
| See Also |

Error codes for StructuralSection related operations.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2018
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public enum StructuralSectionErrorCode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StructuralSectionErrorCode ``` |

| Visual C++ |
| --- |
| ``` public enum class StructuralSectionErrorCode ``` |

# Members

| Member name | Description |
| --- | --- |
| Success |  |
| Failure |  |
| ShapeNotRecognized |  |
| IncompleteDefinition |  |
| ElementNotSupported |  |
| MediumDetailShapeHasRounding |  |
| MediumAndFineDetailShapesAreInconsistent |  |
| ElementHasIndependentJustification |  |

# See Also

Autodesk.Revit.DB.Structure.StructuralSections Namespace